; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city)
                (CONNECTED ?loc1 ?loc2)
        (dummy-goal)
        (dummy-fact)
)
;(:functions (cost))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) ;(dummy-fact)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) ;(dummy-fact)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) ;(dummy-fact)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) ;(dummy-fact)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from) ;(dummy-fact)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (CONNECTED ?loc-from ?loc-to) (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to) ;(dummy-fact)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

;(:action pref-op0
;  :precondition (and (dummy-fact))
;  :effect (and (not (dummy-fact)) (dummy-goal)))

)

; problem
(define (problem logistics-c2-s2-p1-a1)
(:domain logistics-strips)
(:objects a0 a1
          c0 c1 c2
          t0 t1 t2
          l00 l01 l10 l11 l20 l21 
          p0 p1 p2  p3 p4
)
(:INIT 
(AIRPLANE a0)
(AIRPLANE a1)
(CITY c0)
(CITY c1)
(CITY c2)
(TRUCK t0)
(TRUCK t1)
(TRUCK t2)
(LOCATION l00)
(in-city  l00 c0)
(LOCATION l01)
(in-city  l01 c0)
(LOCATION l10)
(in-city  l10 c1)
(LOCATION l11)
(in-city  l11 c1)
(LOCATION l20)
(in-city  l20 c2)
(LOCATION l21)
(in-city  l21 c2)
(AIRPORT l00)
(AIRPORT l10)
(AIRPORT l20)
(OBJ p0)
(OBJ p1)
(OBJ p2)
(at t0 l00)
(at t1 l11)
(at t2 l21)
(at p0 l01)
(at p1 l11)
(at p2 l11)
(CONNECTED l00 l10)
(CONNECTED l10 l00)
(CONNECTED l00 l20)
(at a0 l10)
(at a1 l00)
(OBJ p3)
(at p3 l01)
(OBJ p4)
(at p4 l01)
)
(:goal (and
(at p0 l21) (at p1 l21)  (at p3 l21) (at p4 l21)
))
)

; plan
1. (drive-truck t2 l21 l20 c2)
   deleted: (at t2 l21)
   added: (at t2 l20)
   goals met: 0 of 4
2. (drive-truck t0 l00 l01 c0)
   deleted: (at t0 l00)
   added: (at t0 l01)
   goals met: 0 of 4
3. (load-truck p1 t1 l11)
   deleted: (at p1 l11)
   added: (in p1 t1)
   goals met: 0 of 4
4. (load-truck p0 t0 l01)
   deleted: (at p0 l01)
   added: (in p0 t0)
   goals met: 0 of 4
5. (load-truck p3 t0 l01)
   deleted: (at p3 l01)
   added: (in p3 t0)
   goals met: 0 of 4
6. (load-truck p4 t0 l01)
   deleted: (at p4 l01)
   added: (in p4 t0)
   goals met: 0 of 4
7. (drive-truck t1 l11 l10 c1)
   deleted: (at t1 l11)
   added: (at t1 l10)
   goals met: 0 of 4
8. (drive-truck t0 l01 l00 c0)
   deleted: (at t0 l01)
   added: (at t0 l00)
   goals met: 0 of 4
9. (unload-truck p1 t1 l10)
   deleted: (in p1 t1)
   added: (at p1 l10)
   goals met: 0 of 4
10. (unload-truck p3 t0 l00)
   deleted: (in p3 t0)
   added: (at p3 l00)
   goals met: 0 of 4
11. (unload-truck p4 t0 l00)
   deleted: (in p4 t0)
   added: (at p4 l00)
   goals met: 0 of 4
12. (unload-truck p0 t0 l00)
   deleted: (in p0 t0)
   added: (at p0 l00)
   goals met: 0 of 4
13. (load-airplane p1 a0 l10)
   deleted: (at p1 l10)
   added: (in p1 a0)
   goals met: 0 of 4
14. (load-airplane p0 a1 l00)
   deleted: (at p0 l00)
   added: (in p0 a1)
   goals met: 0 of 4
15. (load-airplane p4 a1 l00)
   deleted: (at p4 l00)
   added: (in p4 a1)
   goals met: 0 of 4
16. (fly-airplane a0 l10 l00)
   deleted: (at a0 l10)
   added: (at a0 l00)
   goals met: 0 of 4
17. (fly-airplane a1 l00 l20)
   deleted: (at a1 l00)
   added: (at a1 l20)
   goals met: 0 of 4
18. (load-airplane p3 a0 l00)
   deleted: (at p3 l00)
   added: (in p3 a0)
   goals met: 0 of 4
19. (unload-airplane p0 a1 l20)
   deleted: (in p0 a1)
   added: (at p0 l20)
   goals met: 0 of 4
20. (fly-airplane a0 l00 l20)
   deleted: (at a0 l00)
   added: (at a0 l20)
   goals met: 0 of 4
21. (unload-airplane p4 a1 l20)
   deleted: (in p4 a1)
   added: (at p4 l20)
   goals met: 0 of 4
22. (load-truck p0 t2 l20)
   deleted: (at p0 l20)
   added: (in p0 t2)
   goals met: 0 of 4
23. (unload-airplane p1 a0 l20)
   deleted: (in p1 a0)
   added: (at p1 l20)
   goals met: 0 of 4
24. (unload-airplane p3 a0 l20)
   deleted: (in p3 a0)
   added: (at p3 l20)
   goals met: 0 of 4
25. (load-truck p4 t2 l20)
   deleted: (at p4 l20)
   added: (in p4 t2)
   goals met: 0 of 4
26. (load-truck p1 t2 l20)
   deleted: (at p1 l20)
   added: (in p1 t2)
   goals met: 0 of 4
27. (load-truck p3 t2 l20)
   deleted: (at p3 l20)
   added: (in p3 t2)
   goals met: 0 of 4
28. (drive-truck t2 l20 l21 c2)
   deleted: (at t2 l20)
   added: (at t2 l21)
   goals met: 0 of 4
29. (unload-truck p0 t2 l21)
   deleted: (in p0 t2)
   added: (at p0 l21)
   goals met: 1 of 4
30. (unload-truck p1 t2 l21)
   deleted: (in p1 t2)
   added: (at p1 l21)
   goals met: 2 of 4
31. (unload-truck p3 t2 l21)
   deleted: (in p3 t2)
   added: (at p3 l21)
   goals met: 3 of 4
32. (unload-truck p4 t2 l21)
   deleted: (in p4 t2)
   added: (at p4 l21)
   goals met: 4 of 4
